// miniprogram/pages/Aboutus/Aboutus.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    img_url:'../../img/2/oneGrade2.jpg',
    content: '“教育的目的是有助于人们接受人类精神文化，并在文化的传递与接受文化的过程中，是每个受教育者的人格得到陶冶，这才是教育的本质和目的，也是教育的全部价值的核心和精华所在。 “应试教育”是一种既不重视理想、能力，也不重视知识文化和科学价值的典型的功利主义教育和凭证教育。科学的教育价值观应是教育的德智体美等方面价值高度统一的价值观，教育的人文价值和科学价值高度统一的价值观。当代教育改革的目的就是要形成新的教育价值，形成科学精神与人文精神统一的人类精神。这才是教育的本质和目的，也是教育的全部价值的核心和精华所在。 “应试教育”是一种既不重视理想、能力，也不重视知识文化和科学价值的典型的功利主义教育和凭证教育。科学的教育价值观应是教育的德智体美等方面价值高度统一的价值观，教育的人文价值和科学价值高度统一的价值观。当代教育改革的目的就是要形成新的教育价值，形成科学精神与人文精神统一的人类精神。'
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function() {

  }
})